#+title: Studies
#+author: Me
#+date: 2021-07-31

Org is a  highly flexible structured plain text  file format, composed
of a  few simple, yet versatile,  structures - constructed to  be both
simple enough for the novice and powerful enough for the expert.

+ Tools I want to get better by month:

* TODO [OS][Book] Modern Operating Systems 4ed
  :LOGBOOK:
  CLOCK: [2021-10-06 qua 19:11]--[2021-10-06 qua 19:15] =>  0:04
  CLOCK: [2021-10-06 qua 18:21]--[2021-10-06 qua 19:10] =>  0:49
  CLOCK: [2021-10-05 ter 19:09]--[2021-10-05 ter 20:03] =>  0:54
  CLOCK: [2021-10-04 seg 19:40]--[2021-10-04 seg 20:30] =>  0:50
  CLOCK: [2021-10-03 dom 21:47]--[2021-10-03 dom 22:40] =>  0:53
  CLOCK: [2021-10-02 sáb 11:02]--[2021-10-02 sáb 12:02] =>  1:00
  CLOCK: [2021-10-01 sex 21:42]--[2021-10-01 sex 22:21] =>  0:39
  CLOCK: [2021-10-01 sex 20:58]--[2021-10-01 sex 21:20] =>  0:22
  :END:
** 2. Processes and threads
   :LOGBOOK:
   CLOCK: [2021-10-12 ter 10:45]--[2021-10-12 ter 12:00] =>  1:15
   CLOCK: [2021-10-11 seg 22:23]--[2021-10-11 seg 22:38] =>  0:15
   CLOCK: [2021-10-10 dom 16:13]--[2021-10-10 dom 16:33] =>  0:20
   CLOCK: [2021-10-10 dom 15:32]--[2021-10-10 dom 16:07] =>  0:35
   CLOCK: [2021-10-09 sáb 17:17]--[2021-10-09 sáb 17:58] =>  0:41
   CLOCK: [2021-10-09 sáb 11:07]--[2021-10-09 sáb 11:53] =>  0:54
   CLOCK: [2021-10-08 sex 20:49]--[2021-10-08 sex 21:32] =>  0:43
   CLOCK: [2021-10-08 sex 20:18]--[2021-10-08 sex 20:44] =>  0:26
   CLOCK: [2021-10-07 qui 18:50]--[2021-10-07 qui 19:27] =>  0:37
   :END:

   The most central concept in any operating system is the process: an
   abstraction of a running program.

   In any  multiprogramming system, the  CPU switches from  process to
   process   quickly,   running  each   for   tens   or  hundreds   of
   milliseconds. While, strictly speaking, at  any one instant the CPU
   is running only one process, in the  course of 1 second it may work
   on several of  them, giving the illusion  of parallelism. Sometimes
   people speak of *pseudoparallelism* in this context, to contrast it
   with  the  true  hardware parallelism  of  *multiprocessor*  system
   (which have two or more CPUs sharing the same physical memory).

   ---
   2.1.1 The Process Model

   A process  is just an  instance of an executing  program, including
   the  current   values  of  the  program   counter,  registers,  and
   variables. Conceptually, each  process has its own  virtual CPU. In
   reality,  of course,  the real  CPU  switches back  and forth  from
   process to process, but to understand the system, it is much easier
   to  think  about a  collection  of  processes running  in  (pseudo)
   parallel than  to try to  keep track of  how the CPU  switches from
   program to program.  This rapid switching back and  forth is called
   *multiprogramming*.

   * In this chapter we will assume there is only one CPU.

   The  difference between  a process  and  a program  is subtle,  but
   absolutely  crucial.  An analogy  may  help  you here.  Consider  a
   culinary-minded computer  scientist who  is baking a  birthday cake
   for his young daughter. He has a birthday cake recipe and a kitchen
   well stocked  with all  the input: flour,  eggs, sugar,  extract of
   vanilla, and  so on. In  this analogy,  the recipe is  the program,
   that  is, an  algorithm expressed  in some  suitable notation,  the
   computer scientist is the processor  (CPU) and the cake ingredients
   are the input  data. The process is the activity  consisting of our
   baker reading the recipe, fetching  the ingredients, and baking the
   cake.

   Now  imagine that  the computer  scientist's son  comes running  in
   screaming his head off, saying that he has been stung by a bee. The
   computer scientist records where he was in the recipe (the state of
   the  current process  is saved),  gets out  a first  aid book,  and
   begins following  the directions in  it. Here we see  the processor
   being  switched  from one  process  (baking)  to a  higher-priority
   process  (administering  medical  care), each  having  a  different
   program (recipe versus first aid book). When the bee sting has been
   taken  care of,  the  computer  scientist goes  back  to his  cake,
   continuing at the point where he left off.

   ---
   2.1.2 Process Creation

   Processes that stay in the  background to handle some activity such
   as  email,  Web  pages,  news,  printing,  and  so  on  are  called
   *daemons*.

   In UNIX  there is  only one  system call to  create a  new process:
   *fork*.  After the  fork, the  two  processes, the  parent and  the
   child, have  the same memory  image, the same  environment strings,
   and the same  open files. Usually, the child  process then executes
   *execve* or  a similar system call  to change its memory  image and
   run a new program.

   ---
   2.1.4 Process Hierarchies

   In some systems, when a process creates another process, the parent
   process  and child  process continue  to be  associated in  certain
   ways. The child process can itself create more processes, forming a
   process hierarchy.  Note that  unlike plants  and animals  that use
   sexual reproduction, a process has  only one parent (but zero, one,
   two, or  more children).  So a  process is more  like a  hydra than
   like, say, a cow.

   In UNIX, a process and all  of its children and further descendants
   together form a process group. When  a user sends a signal from the
   keyboard, the  signal is  delivered to all  members of  the process
   group currently  associated with  the keyboard (usually  all active
   processes that  were created in the  current window). Individually,
   each process can  catch the signal, ignore the signal,  or take the
   default action, which is to be killed by the signal.

   As another example of where the process hierarchy plays a key role,
   let us look at how UNIX initializes itself when it is started, just
   after the computer is booted.  A special process, called *init*, is
   present in the boot image. When  it starts running, it reads a file
   telling  how many  terminals there  are. Then  it forks  off a  new
   process  per terminal.  These  processes wait  for  someone to  log
   in. If a login is successful, the login process executes a shell to
   accept commands. These commands may start up more processes, and so
   forth. Thus,  all the  processes in  the whole  system belong  to a
   single tree, with *init* at the root.

   ---
   2.1.5 Process States

   When  a process  blocks, it  does  so because  logically it  cannot
   continue, typically because it is waiting for input that is not yet
   available. It is  also possible for a process  that is conceptually
   ready and  able to run to  be stopped because the  operating system
   has decided to allocate the CPU to another process for a while.

   Three states a process may be in:

   * Running (actually using the CPU at that instant)
   * Ready (runnable; temporarily stopped to let another process run)
   * Blocked (unable to run until some external event happens)

   ---
   2.1.6 Implementation of Processes

   To implement  the process model,  the operating system  maintains a
   table (an  array of structures),  called the *process  table*, with
   one entry  per process. (Some  authors call these  entries *process
   control blocks*).  This entry contains important  information about
   the process  state, including  its program counter,  stack pointer,
   memory allocation, the status of its open files, its accounting and
   scheduling information, and everything  else about the process that
   must be saved when the process is switched from running to ready or
   blocked state so that it can be  restarted later as if it had never
   been stopped.

   A  process  may  be  interrupted  thousands  of  times  during  its
   execution,  but the  key  idea  is that  after  each interrupt  the
   interrupted process returns  to precisely the same state  it was in
   before the interrupt occurred.

   ---
   2.1.7 Modeling Multiprogramming

   When multiprogramming is used, the CPU utilization can be improved.

   Crudely put, if  the average process computes only 20%  of the time
   it is sitting in memory, then with five processes in memory at once
   the CPU should be busy all  the time. This model is unrealistically
   optimistic,  however,  since  it  tacitly  assumes  that  all  five
   processes will never be waiting for I/O at the same time.

   ---
   *THREADS*

   In traditional operating systems, each process has an address space
   and  a single  thread  of  control. In  fact,  that  is almost  the
   definition of  a process. Nevertheless,  in many situations,  it is
   desirable to have  multiple threads of control in  the same address
   space  running  in quasi-parallel,  as  though  they were  (almost)
   separate processes (except for the shared address space).

   ---
   2.2.1 Thread Usage

   Why would anyone  want to have a kind of  process within a process?
   It  turns   out  there  are   several  reasons  for   having  these
   miniprocesses, called *threads*.

   1st argument:

   The main  reason for having  threads is that in  many applications,
   multiple activities are  going on at once. Some of  these may block
   from time to time. By decomposing such an application into multiple
   sequential  threads that  run  in  quasi-parallel, the  programming
   model becomes simpler.

   Instead of thinking about interrupts, timers, and context switches,
   we can think about parallel processes. Only now with threads we add
   a new  element: the ability for  the parallel entities to  share an
   address space and all of its data among themselves. This ability is
   essential for  certain applications,  which is why  having multiple
   processes (with their separate address spaces) will not work.

   2nd argument:

   Since  they are  lighter  weight than  processes,  they are  easier
   (i.e.  faster)  to  create  and destroy  than  processes.  In  many
   systems, creating a thread goes 10-100 times faster than creating a
   process. When the number of  threads needed changes dynamically and
   rapidly, this property is useful to have.

   3rd argument:

   Threads yield no  performance gain when all of them  are CPU bound,
   but when there  is substantial computing and  also substantial I/O,
   having threads allows these activities to overlap, thus speeding up
   the application.

   Finally, threads  are useful on  systems with multiple  CPUs, where
   real parallelism is possible.

   Threads make it possible to retain the idea of sequential processes
   that make  blocking calls  (e.g., for disk  I/O) and  still achieve
   parallelism.  Blocking  system calls  make programming  easier, and
   parallelism  improves   performance.  The   single-threaded  server
   retains  the  simplicity of  blocking  system  calls but  gives  up
   performance. The  third approach  achieves high  performance though
   parallelism but uses  nonblocking calls and interrupts  and thus is
   hard to program.

   [...] A  third example (I  didn't copy the previous)  where threads
   are useful is in applications  that must process very large amounts
   of data. The normal approach is to read in a block of data, process
   it, and then write  it out again. The problem here  is that if only
   blocking system calls are available,  the process blocks while data
   are coming in and  data are going out. Having the  CPU go idle when
   there is lots of computing to  do is clearly wasteful and should be
   avoided if possible.

   Threads offer a  solution. The process could be  structured with an
   input thread, a processing thread,  and an output thread. The input
   thread reads data into an input buffer. The processing thread takes
   data out of the input buffer,  processes them, and puts the results
   in an output buffer. The output buffer writes these results back to
   disk. In this  way, input, output, and processing can  all be going
   on at the same  time. Of course, this model works  only if a system
   call blocks only the calling thread, not the entire process.

   ---
   2.2.2 The Classical Thread Model

   One  way of  looking at  a process  is that  it is  a way  to group
   related  resources  together.  A   process  has  an  address  space
   containing program text and data, as well as other resources. These
   resources may include open  files, child processes, pending alarms,
   signal handlers, accounting information,  and more. By putting them
   together in the form of a process, they can be managed more easily.

   The other concept  a process has is a thread  of execution, usually
   shortened to just  *thread*. The thread has a  program counter that
   keeps track of which instruction to execute next. It has registers,
   which hold  its current  working variables. It  has a  stack, which
   contains the execution  history, with one frame  for each procedure
   called but not yet returned from. Although a thread must execute in
   some process, the thread and its process are different concepts and
   can be  treated separately. Processes  are used to  group resources
   together; threads are  the entities scheduled for  execution on the
   CPU.

   What  threads  add  to  the  process model  is  to  allow  multiple
   executions  to take  place in  the same  process environment,  to a
   large degree  independent of  one another. Having  multiple threads
   running in parallel in one  process is analogous to having multiple
   processes running in parallel in one computer.

   Because threads have some of  the properties of processes, they are
   sometimes called *lightweight processes*.

   The term *multithreading* is also used to describe the situation of
   allowing multiple threads in the same process.

   When a  multithreaded process  is run on  a single-CPU  system, the
   threads  take turns  running.  By switching  back  and forth  among
   multiple  processes,  the system  gives  the  illusion of  separate
   sequential processes running in  parallel. Multithreading works the
   same  way.  The CPU  switches  rapidly  back  and forth  among  the
   threads, providing  the illusion  that the  threads are  running in
   parallel, albeit  on a  slower CPU  than the  real one.  With three
   compute-bound threads in a process,  the threads would appear to be
   running in parallel, each one on  a CPU with one-third the speed of
   the real CPU.

   Different threads in a process  are not as independent as different
   processes. All threads  have exactly the same  address space, which
   means that they also share the same global variables.

   Since  every thread  can  access every  memory  address within  the
   process address space, one thread can read, write, or even wipe out
   another  thread's stack.  There  is no  protection between  threads
   because (1) it is impossible, and (2) it should not be necessary.

   Unlike different processes,  which may be from  different users and
   which may be hostile to one another, a process is always owned by a
   single user,  who has presumably  created multiple threads  so that
   they can cooperate, not fight.

   In addition to sharing the address space, all the threads can share
   the same set  of open files, child processes,  alarms, and signals,
   and so on.

   Like a traditional  process, a thread can be in  any one of several
   states: running, blocked, ready, or terminated.

   It is important to realize that each thread has its own stack. Each
   thread's stack contains one frame for each procedure called but not
   yet  returned  from.  This  frame contains  the  procedure's  local
   variables and the return address to use when the procedure call has
   finished.

   When  multithreading is  present,  processes usually  start with  a
   single thread  present. This thread  has the ability to  create new
   threads by calling a library procedure such as *thread_create*.

   When  a thread  has finished  its work,  it can  exit by  calling a
   library procedure, say, *thread_exit*.  It  then vanishes and is no
   longer schedulable.

   ---
   2.2.4 Implementing Threads in User Space

   There are two main places to  implement threads: user space and the
   kernel.

   The first  method is to put  the threads packages entirely  in user
   space. The kernel knows nothing about them. As far as the kernel is
   concerned, it is managing  ordinary, single-threaded processes. The
   first, and  most obvious,  advantage is  that a  user-level threads
   package can  be implemented  on an operating  system that  does not
   support threads.

   When threads are managed in user  space, each process needs its own
   private  *thread  table* to  keep  track  of  the threads  in  that
   process. This  table is  analogous to  the kernel's  process table,
   except that it keeps track  only of the per-thread properties, such
   as each thread's program  counter, stack pointer, registers, state,
   and  so  forth.  The  thread  table  is  managed  by  the  run-time
   system. When a thread is moved to ready state or blocked state, the
   information needed  to restart  it is stored  in the  thread table,
   exactly  the  same  way  as the  kernel  stores  information  about
   processes in the process table.

   If the  program calls  or jumps  to an instruction  that is  not in
   memory, a  page fault occurs and  the operating system will  go and
   get the missing instruction (and  its neighbors) from disk. This is
   called a *page fault*.

   ---
   2.2.5 Implementing Threads in the Kernel

   When the  kernel knows  about and manage  the threads,  no run-time
   system is  needed in each thread,  and there is no  thread table in
   each process.  Instead, the  kernel has a  thread table  that keeps
   track of  all the  threads in  the system. When  a thread  wants to
   create  a new  thread or  destroy an  existing thread,  it makes  a
   kernel  call,  which  then  does the  creation  or  destruction  by
   updating the kernel thread table.

   Their  main disadvantage  is  that the  cost of  a  system call  is
   substantial, so if thread  operations (creation, termination, etc.)
   a common, much more overhead will be incurred.

   ---
   2.2.6 Hybrid Implementation

   Various  ways  have  been  investigated   to  try  to  combine  the
   advantages of user-level threads with kernel-level threads. One way
   is use  kernel-level threads and then  multiplex user-level threads
   onto some or all of them.

   With this  approach, the kernel  is aware of only  the kernel-level
   threads  and  schedules  those.  Some of  those  threads  may  have
   multiple  user-level  threads multiplexed  on  top  of them.  These
   user-level  threads are  created, destroyed,  and rescheduled  just
   like  user-level threads  in a  process that  runs on  an operating
   system  without  multithreading  capability. In  this  model,  each
   kernel-level thread  has some set  of user-level threads  that take
   turns using it.

   ---
   2.2.7 Scheduler Activations

   While kernel threads are better than user-level threads in some key
   ways, they are also indisputably slower.

   The  goals  of the  scheduler  activation  work  are to  mimic  the
   functionality of  kernel threads,  but with the  better performance
   and greater  flexibility usually  associated with  threads packages
   implemented in user space.

   When scheduler activations  are used, the kernel  assigns a certain
   number  of  virtual   processor  to  each  process   and  lets  the
   (user-space) run-time system allocate threads to processor.

   ---
   2.2.8 Pop-Up Threads

   ---
   2.2.9 Making Single-Threaded Code Multithreaded

   Many   existing   programs   were   written   for   single-threaded
   processes. Converting these to multithreading is much trickier than
   it may at first appear.

   * Few of the pitfalls:

   The code of a thread normally consists of multiple procedures, just
   like a process.  These may have local  variables, global variables,
   and parameters.  Local variables  and parameters  do not  cause any
   trouble, but variables  that are global to a thread  but not global
   to the entire  program are a problem. These are  variables that are
   global in the sense that many procedures within the thread use them
   (as they might  use any global variable), but  other threads should
   logically leave them alone.

   As an example, consider the errno variable maintained by UNIX. When
   a process (or  a thread) makes a system call  that fails, the error
   code is put into errno. Imagine that a thread 1 executes the system
   call access  to find out if  it has permission to  access a certain
   file.  The  operating  system  returns the  answer  in  the  global
   variable errno. After control has  returned to thread 1, but before
   it has a chance to read  errno, the scheduler decides that thread 1
   has had  enough CPU time  for the moment  and decides to  switch to
   thread 2. Thread  2 executes an open call that  fails, which causes
   errno  to be  overwritten  and thread  1's acess  code  to be  lost
   forever. When  thread 1  starts up  later, it  will read  the wrong
   value and behave incorrectly.

   Various solutions to this problem  are possible. One is to prohibit
   global variables altogether.  However worthy this ideal  may be, it
   conflicts with  much existing software.  Another is to  assign each
   thread its own  private global variables. In this  way, each thread
   has its  own private copy of  errno and other global  variables, so
   conflicts are avoided.

   The  next  problem in  turning  a  single-threaded program  into  a
   multithreaded  one   is  that  many  library   procedures  are  not
   reentrant. That  is, they were not  designed to have a  second call
   made  to any  given procedure  while a  previous call  has not  yet
   finished. For example, sending a  message over the network may well
   be programmed to assemble the message  in a fixed buffer within the
   library, then to trap to the kernel to send it. What happens if one
   thread  has assembled  its  message  in the  buffer,  then a  clock
   interrupt  forces a  switch  to a  second  thread that  immediately
   overwrites the buffer with its own message?

   Fixing all  these problems  effectively means rewriting  the entire
   library. Doing so is a  nontrivial activity with a real possibility
   of introducing subtle errors.

   A different  solution is  to provide each  procedure with  a jacket
   that sets  a bit  to mark the  library as in  use. Any  attempt for
   another thread to use a library procedure while a previous call has
   not yet completed is blocked. Although this approach can be made to
   work, it greatly eliminates potential parallelism.

   ---
   2.3 INTERPROCESS COMMUNICATION

   Process frequently  need to  communicate with other  processes. For
   example, in a shell pipeline, the  output of the first process must
   be passed  to the  second process,  and so on  down the  line. Thus
   there is a need for  communication between processes, preferably in
   a  well-structured  way  not  using interrupts.  In  the  following
   sections  we will  look  at  some of  the  issues  related to  this
   *InterProcess Communication*, or *IPC*.

   Very briefly, there are three issues here:

   1. How one process can pass information to another?

   2. How can you make sure two or more processes do not get in each
      other's way, for example, two processes in an airline reservation
      system each trying to grab the last seat on a plane for a
      different customer.

   3. The third concerns proper sequencing when dependencies are present:
      if process A  produces data and process B prints  them, B has to
      wait until A has produced some data before starting to print.

   It is  also important  to mention  that two  of these  issues apply
   equally well to  threads. The first one - passing  information - is
   easy for threads  since they share a common  address space (threads
   in different address spaces that need to communicate fall under the
   heading  of  communicating processes).  However,  the  other two  -
   keeping  out of  each other's  hair and  proper sequencing  - apply
   equally  well to  threads. The  same  problems exist  and the  same
   solutions apply.

   ---
   2.3.1 Race Conditions

   In some operating systems, processes  that are working together may
   share some common storage that each one can read and write.

   Situations where two or more  processes are reading or writing some
   shared  data and  the final  result depends  on who  runs precisely
   when, are  called *race conditions*. Debugging  programs containing
   race conditions is no fun at all. The results of most test runs are
   fine,  but once  in a  blue  moon something  weird and  unexplained
   happens.   Unforunately,  with   increasing   parallelism  due   to
   increasing  numbers  of cores,  race  condition  are becoming  more
   common.

   ---
   2.3.2 Critical Regions

   How do we avoid race conditions? The key to preventing trouble here
   and in many other situations involving shared memory, shared files,
   and shared  everything else is  to find  some way to  prohibit more
   than one  process from reading and  writing the shared data  at the
   same time. Put in other words,  what we need is *mutual exclusion*,
   that is,  some way of  making sure that if  one process is  using a
   shared variable or file, the  other processes will be excluded from
   doing the same thing.

   The problem of  avoiding race conditions can also  be formulated in
   an abstract way. Part of the time, a process is busy doing internal
   computations  and   other  things   that  do   not  lead   to  race
   conditions.  However,  sometimes a  process  has  to access  shared
   memory  or files,  or do  other critical  things that  can lead  to
   races. That part of the program where the shared memory is accessed
   is called the *critical region*  or *critical section*. If we could
   arrange  matters such  that no  two  processes were  ever in  their
   critical regions at the same time, we could avoid races.

   Although  this  requirement  avoids  race  conditions,  it  is  not
   sufficient for  having parallel  processes cooperate  correctly and
   efficiently using shared  data. We need four conditions  to hold to
   have a good solution.

   1. No two processes may be simultaneously inside their critical regions

   2. No assumptions may be made about speeds or the number of CPUs

   3. No process running outside its critical region may block any process

   4. No process should have to wait forever to enter its critical region

   ---
   2.3.3 Mutual Exclusion with Busy Waiting

   *Disabling Interrupts*

   On a single-processor system, the simplest solution is to have each
   process  disable all  interrupts just  after entering  its critical
   region and re-enable them just before leaving it.

   In  a   multicore  (i.e.,  multiprocessor  system)   disabling  the
   interrupts of one CPU does  not prevent other CPUs from interfering
   with  operations the  first CPU  is performing.  Consequently, more
   sophisticated schemes are needed.

   *Lock Variables*

   As a second attempts, let us look for a software solution. Consider
   having  a  single, shared  (lock)  variable,  initially 0.  When  a
   process  wants to  enter its  critical region,  it first  tests the
   lock. If  the lock is 0,  the process sets  it to 1 and  enters the
   critical region. If  the lock is already 1, the  process just waits
   until it  becomes 0.  Thus, a  0 means  that no  process is  in its
   critical region, and a 1 means that some process is in its critical
   region.

   This is sucetive to some  race conditions. Suppose that one process
   reads the lock and sees that it is 0. Before it can set the lock to
   1, another process is scheduled, runs  and sets the lock to 1. When
   the first process runs  again, it will also set the  lock to 1, and
   two processes will be in their critical regions at the same time.

   *Strict Alternation*

   *Peterson's Solution*

   *The TSL Instruction*

   ---
   2.3.5 Semaphores

   In  the  beginning  a  new  variable  type  was  introduced  called
   *semaphore*. A semaphore could have the value 0, indicating that no
   process wakeups were  saved, or more positive value if  one or more
   wakeups were pending.

   Dijkstra proposed having two  operations on semaphores, now usually
   called  down   and  up   (generalizations  of  sleep   and  wakeup,
   respectively). The down  oepration on a semaphore checks  to see if
   the value is greater than 0.  If so, it decrements the value (i.e.,
   uses up one  stored wakeup) and just continues. If  the value is 0,
   the process  is put to  sleep without  completing the down  for the
   moment.  Checking the  value, changing  it, and  possibly going  to
   sleep, are all done as a single, indivisible *atomic action*. It is
   garanteed that  once a  semaphore operation  has started,  no other
   process can access the semaphore  until the operation has completed
   or  blocked.  This atomicity  is  absolutely  essential to  solving
   synchronization problems and avoiding race conditions.

   Atomic actions, in  which a group of related  operations are either
   all performed  without interruption  or not  performed at  all, are
   extremely  important in  many other  areas of  computer science  as
   well.

   ---
   2.3.6 Mutexes

   When the semaphore's  ability to count is not  needed, a simplified
   version   of  the   semaphore,   called  a   mutex,  is   sometimes
   used. Mutexes are  good only for managing mutual  exclusion to some
   shared resource  or piece of code.  They are easy and  efficient to
   implement, which  makes them  especially useful in  thread packages
   that are implemented entirely in user space.

   A *mutex* is  a shared variable that  can be in one  of two states:
   unlocked  or  locked.  Consequently,  only 1  bit  is  required  to
   represent it,  but in  practice an  integer often  is used,  with 0
   meaning unlocked and all other values meaning locked.

   *Futex*

   A futex is  a feature of Linux that implements  basic locking (much
   like a mutex) but avoids dropping  into the kernel unless it really
   has to. Since switching to the  kernel and back is quite expensive,
   doing so improves performance considerably.

   ---
   2.3.7 Monitors

   To make it  easier to write correct programs  some researchers have
   proposed   a  higher-level   synchronization  primitive   called  a
   *monitor*. A monitor is a  collection of procedures, variables, and
   data structures that are all grouped  together in a special kind of
   module or package.  Processes may call the procedures  in a monitor
   whenever  they  want  to,  but  they  cannot  directly  access  the
   monitor's internal data structures from procedures declared outside
   the monitor.

   C cannot be used here because monitors are a language concept and C
   does not have them.

   Monitors  have an  important property  that makes  them useful  for
   achieving mutual  exclusion: only  one process can  be active  in a
   monitor  at  any  instant.   Monitors  are  a  programming-language
   construct, so  the compiler knows  they are special and  can handle
   calls to monitor procedures differently from other procedure calls.
* HOLD [Economics][Book] Economics in one lesson                       :HOLD:
  - State "HOLD"       from "NEXT"       [2021-10-23 sáb 10:41] \\
    I need to do other stuff first
  :LOGBOOK:
  CLOCK: [2021-10-12 ter 09:47]--[2021-10-12 ter 10:26] =>  0:39
  CLOCK: [2021-10-12 ter 09:30]--[2021-10-12 ter 09:46] =>  0:16
  :END:
